spec/support/vcr_cassettes/TransactionScripts_Subscription_ApplyCode_apply_stripe_coupon_success.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_CImeiHqroHbWOk
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.9.1
      Authorization:
      - "<AUTHORIZATION>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.9.1","lang":"ruby","lang_version":"2.4.3 p205 (2017-12-14)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.13.0-32-generic (buildd@lgw01-amd64-004) (gcc version 5.4.0 20160609
        (Ubuntu 5.4.0-6ubuntu1~16.04.5)) #35~16.04.1-Ubuntu SMP Thu Jan 25 10:13:43
        UTC 2018","hostname":"vasily-hp-laptop"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 20 Feb 2018 12:53:43 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1227'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_O7GqVcIxLIKDjw
      Stripe-Version:
      - '2017-06-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_CImeiHqroHbWOk",
          "object": "customer",
          "account_balance": 0,
          "created": 1518318043,
          "currency": "usd",
          "default_source": null,
          "delinquent": false,
          "description": null,
          "discount": {
            "object": "discount",
            "coupon": {
              "id": "PAUSED-SUBSCRIPTION-DO-NOT-DELETE",
              "object": "coupon",
              "amount_off": null,
              "created": 1519007078,
              "currency": null,
              "duration": "forever",
              "duration_in_months": null,
              "livemode": false,
              "max_redemptions": null,
              "metadata": {},
              "percent_off": 100,
              "redeem_by": null,
              "times_redeemed": 2,
              "valid": true
            },
            "customer": "cus_CImeiHqroHbWOk",
            "end": null,
            "start": 1519034784,
            "subscription": null
          },
          "email": "ellamdcustomer+1@gmail.com",
          "invoice_prefix": "f8827b582d",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_CImeiHqroHbWOk/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_CImeiHqroHbWOk/subscriptions"
          }
        }
    http_version: 
  recorded_at: Tue, 20 Feb 2018 12:53:43 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_CImeiHqroHbWOk
    body:
      encoding: UTF-8
      string: coupon=50OFF
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.9.1
      Authorization:
      - "<AUTHORIZATION>"
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.9.1","lang":"ruby","lang_version":"2.4.3 p205 (2017-12-14)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.13.0-32-generic (buildd@lgw01-amd64-004) (gcc version 5.4.0 20160609
        (Ubuntu 5.4.0-6ubuntu1~16.04.5)) #35~16.04.1-Ubuntu SMP Thu Jan 25 10:13:43
        UTC 2018","hostname":"vasily-hp-laptop"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 20 Feb 2018 12:53:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1202'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_EkXRhuK6HUyB7H
      Stripe-Version:
      - '2017-06-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_CImeiHqroHbWOk",
          "object": "customer",
          "account_balance": 0,
          "created": 1518318043,
          "currency": "usd",
          "default_source": null,
          "delinquent": false,
          "description": null,
          "discount": {
            "object": "discount",
            "coupon": {
              "id": "50OFF",
              "object": "coupon",
              "amount_off": null,
              "created": 1516214202,
              "currency": null,
              "duration": "repeating",
              "duration_in_months": 3,
              "livemode": false,
              "max_redemptions": 100,
              "metadata": {},
              "percent_off": 50,
              "redeem_by": null,
              "times_redeemed": 6,
              "valid": true
            },
            "customer": "cus_CImeiHqroHbWOk",
            "end": 1526820824,
            "start": 1519131224,
            "subscription": null
          },
          "email": "ellamdcustomer+1@gmail.com",
          "invoice_prefix": "f8827b582d",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_CImeiHqroHbWOk/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_CImeiHqroHbWOk/subscriptions"
          }
        }
    http_version: 
  recorded_at: Tue, 20 Feb 2018 12:53:44 GMT
recorded_with: VCR 4.0.0
